var JSONdata

export default JSONdata = {
	"code": 200,
	"msg": "success",
	"data": {
		"provinces": [
			{
				"name": "北京市",
				"pid": "0",
				"level": "1",
				"id": "110000",
				"code": "110000",
				"sort": "99999",
				"cities": [
					{
						"name": "北京市",
						"pid": "110000",
						"level": "2",
						"id": "110100",
						"code": "110100",
						"sort": "2",
						"districts": [
							{
								"name": "丰台区",
								"pid": "110100",
								"level": "3",
								"id": "110106",
								"code": "110106",
								"sort": "99999"
							},
							{
								"name": "石景山区",
								"pid": "110100",
								"level": "3",
								"id": "110107",
								"code": "110107",
								"sort": "99999"
							},
							{
								"name": "海淀区",
								"pid": "110100",
								"level": "3",
								"id": "110108",
								"code": "110108",
								"sort": "99999"
							},
							{
								"name": "房山区",
								"pid": "110100",
								"level": "3",
								"id": "110111",
								"code": "110111",
								"sort": "99999"
							},
							{
								"name": "通州区",
								"pid": "110100",
								"level": "3",
								"id": "110112",
								"code": "110112",
								"sort": "99999"
							},
							{
								"name": "昌平区",
								"pid": "110100",
								"level": "3",
								"id": "110114",
								"code": "110114",
								"sort": "99999"
							},
							{
								"name": "大兴区",
								"pid": "110100",
								"level": "3",
								"id": "110115",
								"code": "110115",
								"sort": "99999"
							},
							{
								"name": "朝阳区",
								"pid": "110100",
								"level": "3",
								"id": "110118",
								"code": "110118",
								"sort": "99999"
							},
							{
								"name": "东城区",
								"pid": "110100",
								"level": "3",
								"id": "110119",
								"code": "110119",
								"sort": "99999"
							},
							{
								"name": "西城区",
								"pid": "110100",
								"level": "3",
								"id": "110120",
								"code": "110120",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "天津市",
				"pid": "0",
				"level": "1",
				"id": "120000",
				"code": "120000",
				"sort": "99999",
				"cities": [
					{
						"name": "天津市",
						"pid": "120000",
						"level": "2",
						"id": "120100",
						"code": "120100",
						"sort": "14",
						"districts": [
							{
								"name": "和平区",
								"pid": "120100",
								"level": "3",
								"id": "120101",
								"code": "120101",
								"sort": "99999"
							},
							{
								"name": "河东区",
								"pid": "120100",
								"level": "3",
								"id": "120102",
								"code": "120102",
								"sort": "99999"
							},
							{
								"name": "河西区",
								"pid": "120100",
								"level": "3",
								"id": "120103",
								"code": "120103",
								"sort": "99999"
							},
							{
								"name": "南开区",
								"pid": "120100",
								"level": "3",
								"id": "120104",
								"code": "120104",
								"sort": "99999"
							},
							{
								"name": "河北区",
								"pid": "120100",
								"level": "3",
								"id": "120105",
								"code": "120105",
								"sort": "99999"
							},
							{
								"name": "红桥区",
								"pid": "120100",
								"level": "3",
								"id": "120106",
								"code": "120106",
								"sort": "99999"
							},
							{
								"name": "东丽区",
								"pid": "120100",
								"level": "3",
								"id": "120110",
								"code": "120110",
								"sort": "99999"
							},
							{
								"name": "西青区",
								"pid": "120100",
								"level": "3",
								"id": "120111",
								"code": "120111",
								"sort": "99999"
							},
							{
								"name": "北辰区",
								"pid": "120100",
								"level": "3",
								"id": "120113",
								"code": "120113",
								"sort": "99999"
							},
							{
								"name": "滨海新区",
								"pid": "120100",
								"level": "3",
								"id": "120116",
								"code": "120116",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "河北省",
				"pid": "0",
				"level": "1",
				"id": "130000",
				"code": "130000",
				"sort": "99999",
				"cities": [
					{
						"name": "保定市",
						"pid": "130000",
						"level": "2",
						"id": "130600",
						"code": "130600",
						"sort": "99999",
						"districts": [
							{
								"name": "竞秀区",
								"pid": "130600",
								"level": "3",
								"id": "130602",
								"code": "130602",
								"sort": "99999"
							},
							{
								"name": "莲池区",
								"pid": "130600",
								"level": "3",
								"id": "130606",
								"code": "130606",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "山西省",
				"pid": "0",
				"level": "1",
				"id": "140000",
				"code": "140000",
				"sort": "99999",
				"cities": [
					{
						"name": "太原市",
						"pid": "140000",
						"level": "2",
						"id": "140100",
						"code": "140100",
						"sort": "99999",
						"districts": [
							{
								"name": "小店区",
								"pid": "140100",
								"level": "3",
								"id": "140105",
								"code": "140105",
								"sort": "99999"
							},
							{
								"name": "迎泽区",
								"pid": "140100",
								"level": "3",
								"id": "140106",
								"code": "140106",
								"sort": "99999"
							},
							{
								"name": "杏花岭区",
								"pid": "140100",
								"level": "3",
								"id": "140107",
								"code": "140107",
								"sort": "99999"
							},
							{
								"name": "尖草坪区",
								"pid": "140100",
								"level": "3",
								"id": "140108",
								"code": "140108",
								"sort": "99999"
							},
							{
								"name": "万柏林区",
								"pid": "140100",
								"level": "3",
								"id": "140109",
								"code": "140109",
								"sort": "99999"
							},
							{
								"name": "晋源区",
								"pid": "140100",
								"level": "3",
								"id": "140110",
								"code": "140110",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "辽宁省",
				"pid": "0",
				"level": "1",
				"id": "210000",
				"code": "210000",
				"sort": "99999",
				"cities": [
					{
						"name": "沈阳市",
						"pid": "210000",
						"level": "2",
						"id": "210100",
						"code": "210100",
						"sort": "26",
						"districts": [
							{
								"name": "和平区",
								"pid": "210100",
								"level": "3",
								"id": "210102",
								"code": "210102",
								"sort": "99999"
							},
							{
								"name": "沈河区",
								"pid": "210100",
								"level": "3",
								"id": "210103",
								"code": "210103",
								"sort": "99999"
							},
							{
								"name": "大东区",
								"pid": "210100",
								"level": "3",
								"id": "210104",
								"code": "210104",
								"sort": "99999"
							},
							{
								"name": "皇姑区",
								"pid": "210100",
								"level": "3",
								"id": "210105",
								"code": "210105",
								"sort": "99999"
							},
							{
								"name": "铁西区",
								"pid": "210100",
								"level": "3",
								"id": "210106",
								"code": "210106",
								"sort": "99999"
							},
							{
								"name": "浑南区",
								"pid": "210100",
								"level": "3",
								"id": "210112",
								"code": "210112",
								"sort": "99999"
							},
							{
								"name": "沈北新区",
								"pid": "210100",
								"level": "3",
								"id": "210113",
								"code": "210113",
								"sort": "99999"
							},
							{
								"name": "于洪区",
								"pid": "210100",
								"level": "3",
								"id": "210114",
								"code": "210114",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "黑龙江省",
				"pid": "0",
				"level": "1",
				"id": "230000",
				"code": "230000",
				"sort": "99999",
				"cities": [
					{
						"name": "哈尔滨市",
						"pid": "230000",
						"level": "2",
						"id": "230100",
						"code": "230100",
						"sort": "24",
						"districts": [
							{
								"name": "道里区",
								"pid": "230100",
								"level": "3",
								"id": "230102",
								"code": "230102",
								"sort": "99999"
							},
							{
								"name": "南岗区",
								"pid": "230100",
								"level": "3",
								"id": "230103",
								"code": "230103",
								"sort": "99999"
							},
							{
								"name": "道外区",
								"pid": "230100",
								"level": "3",
								"id": "230104",
								"code": "230104",
								"sort": "99999"
							},
							{
								"name": "香坊区",
								"pid": "230100",
								"level": "3",
								"id": "230110",
								"code": "230110",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "上海市",
				"pid": "0",
				"level": "1",
				"id": "310000",
				"code": "310000",
				"sort": "99999",
				"cities": [
					{
						"name": "上海市",
						"pid": "310000",
						"level": "2",
						"id": "310100",
						"code": "310100",
						"sort": "1",
						"districts": [
							{
								"name": "黄浦区",
								"pid": "310100",
								"level": "3",
								"id": "310101",
								"code": "310101",
								"sort": "99999"
							},
							{
								"name": "徐汇区",
								"pid": "310100",
								"level": "3",
								"id": "310104",
								"code": "310104",
								"sort": "99999"
							},
							{
								"name": "长宁区",
								"pid": "310100",
								"level": "3",
								"id": "310105",
								"code": "310105",
								"sort": "99999"
							},
							{
								"name": "静安区",
								"pid": "310100",
								"level": "3",
								"id": "310106",
								"code": "310106",
								"sort": "99999"
							},
							{
								"name": "普陀区",
								"pid": "310100",
								"level": "3",
								"id": "310107",
								"code": "310107",
								"sort": "99999"
							},
							{
								"name": "闸北区",
								"pid": "310100",
								"level": "3",
								"id": "310108",
								"code": "310108",
								"sort": "99999"
							},
							{
								"name": "虹口区",
								"pid": "310100",
								"level": "3",
								"id": "310109",
								"code": "310109",
								"sort": "99999"
							},
							{
								"name": "杨浦区",
								"pid": "310100",
								"level": "3",
								"id": "310110",
								"code": "310110",
								"sort": "99999"
							},
							{
								"name": "闵行区",
								"pid": "310100",
								"level": "3",
								"id": "310112",
								"code": "310112",
								"sort": "99999"
							},
							{
								"name": "宝山区",
								"pid": "310100",
								"level": "3",
								"id": "310113",
								"code": "310113",
								"sort": "99999"
							},
							{
								"name": "嘉定区",
								"pid": "310100",
								"level": "3",
								"id": "310114",
								"code": "310114",
								"sort": "99999"
							},
							{
								"name": "浦东新区",
								"pid": "310100",
								"level": "3",
								"id": "310115",
								"code": "310115",
								"sort": "99999"
							},
							{
								"name": "松江区",
								"pid": "310100",
								"level": "3",
								"id": "310117",
								"code": "310117",
								"sort": "99999"
							},
							{
								"name": "青浦区",
								"pid": "310100",
								"level": "3",
								"id": "310118",
								"code": "310118",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "江苏省",
				"pid": "0",
				"level": "1",
				"id": "320000",
				"code": "320000",
				"sort": "99999",
				"cities": [
					{
						"name": "南京市",
						"pid": "320000",
						"level": "2",
						"id": "320100",
						"code": "320100",
						"sort": "6",
						"districts": [
							{
								"name": "市辖区",
								"pid": "320100",
								"level": "3",
								"id": "320101",
								"code": "320101",
								"sort": "99999"
							},
							{
								"name": "玄武区",
								"pid": "320100",
								"level": "3",
								"id": "320102",
								"code": "320102",
								"sort": "99999"
							},
							{
								"name": "秦淮区",
								"pid": "320100",
								"level": "3",
								"id": "320104",
								"code": "320104",
								"sort": "99999"
							},
							{
								"name": "建邺区",
								"pid": "320100",
								"level": "3",
								"id": "320105",
								"code": "320105",
								"sort": "99999"
							},
							{
								"name": "鼓楼区",
								"pid": "320100",
								"level": "3",
								"id": "320106",
								"code": "320106",
								"sort": "99999"
							},
							{
								"name": "浦口区",
								"pid": "320100",
								"level": "3",
								"id": "320111",
								"code": "320111",
								"sort": "99999"
							},
							{
								"name": "栖霞区",
								"pid": "320100",
								"level": "3",
								"id": "320113",
								"code": "320113",
								"sort": "99999"
							},
							{
								"name": "雨花台区",
								"pid": "320100",
								"level": "3",
								"id": "320114",
								"code": "320114",
								"sort": "99999"
							},
							{
								"name": "江宁区",
								"pid": "320100",
								"level": "3",
								"id": "320115",
								"code": "320115",
								"sort": "99999"
							}
						]
					},
					{
						"name": "无锡市",
						"pid": "320000",
						"level": "2",
						"id": "320200",
						"code": "320200",
						"sort": "17",
						"districts": [
							{
								"name": "锡山区",
								"pid": "320200",
								"level": "3",
								"id": "320205",
								"code": "320205",
								"sort": "99999"
							},
							{
								"name": "惠山区",
								"pid": "320200",
								"level": "3",
								"id": "320206",
								"code": "320206",
								"sort": "99999"
							},
							{
								"name": "滨湖区",
								"pid": "320200",
								"level": "3",
								"id": "320211",
								"code": "320211",
								"sort": "99999"
							},
							{
								"name": "梁溪区",
								"pid": "320200",
								"level": "3",
								"id": "320213",
								"code": "320213",
								"sort": "99999"
							},
							{
								"name": "新吴区",
								"pid": "320200",
								"level": "3",
								"id": "320214",
								"code": "320214",
								"sort": "99999"
							},
							{
								"name": "江阴市",
								"pid": "320200",
								"level": "3",
								"id": "320281",
								"code": "320281",
								"sort": "99999"
							}
						]
					},
					{
						"name": "常州市",
						"pid": "320000",
						"level": "2",
						"id": "320400",
						"code": "320400",
						"sort": "99999",
						"districts": [
							{
								"name": "天宁区",
								"pid": "320400",
								"level": "3",
								"id": "320402",
								"code": "320402",
								"sort": "99999"
							},
							{
								"name": "钟楼区",
								"pid": "320400",
								"level": "3",
								"id": "320404",
								"code": "320404",
								"sort": "99999"
							},
							{
								"name": "戚墅堰区",
								"pid": "320400",
								"level": "3",
								"id": "320405",
								"code": "320405",
								"sort": "99999"
							},
							{
								"name": "新北区",
								"pid": "320400",
								"level": "3",
								"id": "320411",
								"code": "320411",
								"sort": "99999"
							},
							{
								"name": "武进区",
								"pid": "320400",
								"level": "3",
								"id": "320412",
								"code": "320412",
								"sort": "99999"
							}
						]
					},
					{
						"name": "苏州市",
						"pid": "320000",
						"level": "2",
						"id": "320500",
						"code": "320500",
						"sort": "10",
						"districts": [
							{
								"name": "虎丘区",
								"pid": "320500",
								"level": "3",
								"id": "320505",
								"code": "320505",
								"sort": "99999"
							},
							{
								"name": "吴中区",
								"pid": "320500",
								"level": "3",
								"id": "320506",
								"code": "320506",
								"sort": "99999"
							},
							{
								"name": "相城区",
								"pid": "320500",
								"level": "3",
								"id": "320507",
								"code": "320507",
								"sort": "99999"
							},
							{
								"name": "姑苏区",
								"pid": "320500",
								"level": "3",
								"id": "320508",
								"code": "320508",
								"sort": "99999"
							},
							{
								"name": "吴江区",
								"pid": "320500",
								"level": "3",
								"id": "320509",
								"code": "320509",
								"sort": "99999"
							},
							{
								"name": "昆山市",
								"pid": "320500",
								"level": "3",
								"id": "320583",
								"code": "320583",
								"sort": "1"
							}
						]
					}
				]
			},
			{
				"name": "浙江省",
				"pid": "0",
				"level": "1",
				"id": "330000",
				"code": "330000",
				"sort": "99999",
				"cities": [
					{
						"name": "杭州市",
						"pid": "330000",
						"level": "2",
						"id": "330100",
						"code": "330100",
						"sort": "5",
						"districts": [
							{
								"name": "上城区",
								"pid": "330100",
								"level": "3",
								"id": "330102",
								"code": "330102",
								"sort": "99999"
							},
							{
								"name": "下城区",
								"pid": "330100",
								"level": "3",
								"id": "330103",
								"code": "330103",
								"sort": "99999"
							},
							{
								"name": "江干区",
								"pid": "330100",
								"level": "3",
								"id": "330104",
								"code": "330104",
								"sort": "99999"
							},
							{
								"name": "拱墅区",
								"pid": "330100",
								"level": "3",
								"id": "330105",
								"code": "330105",
								"sort": "99999"
							},
							{
								"name": "西湖区",
								"pid": "330100",
								"level": "3",
								"id": "330106",
								"code": "330106",
								"sort": "99999"
							},
							{
								"name": "滨江区",
								"pid": "330100",
								"level": "3",
								"id": "330108",
								"code": "330108",
								"sort": "99999"
							},
							{
								"name": "萧山区",
								"pid": "330100",
								"level": "3",
								"id": "330109",
								"code": "330109",
								"sort": "99999"
							},
							{
								"name": "余杭区",
								"pid": "330100",
								"level": "3",
								"id": "330110",
								"code": "330110",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "安徽省",
				"pid": "0",
				"level": "1",
				"id": "340000",
				"code": "340000",
				"sort": "99999",
				"cities": [
					{
						"name": "合肥市",
						"pid": "340000",
						"level": "2",
						"id": "340100",
						"code": "340100",
						"sort": "19",
						"districts": [
							{
								"name": "政务区",
								"pid": "340100",
								"level": "3",
								"id": "340101",
								"code": "340101",
								"sort": "99999"
							},
							{
								"name": "瑶海区",
								"pid": "340100",
								"level": "3",
								"id": "340102",
								"code": "340102",
								"sort": "99999"
							},
							{
								"name": "庐阳区",
								"pid": "340100",
								"level": "3",
								"id": "340103",
								"code": "340103",
								"sort": "99999"
							},
							{
								"name": "蜀山区",
								"pid": "340100",
								"level": "3",
								"id": "340104",
								"code": "340104",
								"sort": "99999"
							},
							{
								"name": "包河区",
								"pid": "340100",
								"level": "3",
								"id": "340111",
								"code": "340111",
								"sort": "99999"
							},
							{
								"name": "肥东县",
								"pid": "340100",
								"level": "3",
								"id": "340122",
								"code": "340122",
								"sort": "99999"
							},
							{
								"name": "肥西县",
								"pid": "340100",
								"level": "3",
								"id": "340123",
								"code": "340123",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "福建省",
				"pid": "0",
				"level": "1",
				"id": "350000",
				"code": "350000",
				"sort": "99999",
				"cities": [
					{
						"name": "福州市",
						"pid": "350000",
						"level": "2",
						"id": "350100",
						"code": "350100",
						"sort": "21",
						"districts": [
							{
								"name": "鼓楼区",
								"pid": "350100",
								"level": "3",
								"id": "350102",
								"code": "350102",
								"sort": "99999"
							},
							{
								"name": "台江区",
								"pid": "350100",
								"level": "3",
								"id": "350103",
								"code": "350103",
								"sort": "99999"
							},
							{
								"name": "仓山区",
								"pid": "350100",
								"level": "3",
								"id": "350104",
								"code": "350104",
								"sort": "99999"
							},
							{
								"name": "马尾区",
								"pid": "350100",
								"level": "3",
								"id": "350105",
								"code": "350105",
								"sort": "99999"
							},
							{
								"name": "晋安区",
								"pid": "350100",
								"level": "3",
								"id": "350111",
								"code": "350111",
								"sort": "99999"
							},
							{
								"name": "长乐区",
								"pid": "350100",
								"level": "3",
								"id": "350112",
								"code": "350112",
								"sort": "99999"
							},
							{
								"name": "闽侯县",
								"pid": "350100",
								"level": "3",
								"id": "350121",
								"code": "350121",
								"sort": "99999"
							},
							{
								"name": "长乐市",
								"pid": "350100",
								"level": "3",
								"id": "350182",
								"code": "350182",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "山东省",
				"pid": "0",
				"level": "1",
				"id": "370000",
				"code": "370000",
				"sort": "99999",
				"cities": [
					{
						"name": "济南市",
						"pid": "370000",
						"level": "2",
						"id": "370100",
						"code": "370100",
						"sort": "25",
						"districts": [
							{
								"name": "历下区",
								"pid": "370100",
								"level": "3",
								"id": "370102",
								"code": "370102",
								"sort": "99999"
							},
							{
								"name": "市中区",
								"pid": "370100",
								"level": "3",
								"id": "370103",
								"code": "370103",
								"sort": "99999"
							},
							{
								"name": "槐荫区",
								"pid": "370100",
								"level": "3",
								"id": "370104",
								"code": "370104",
								"sort": "99999"
							},
							{
								"name": "天桥区",
								"pid": "370100",
								"level": "3",
								"id": "370105",
								"code": "370105",
								"sort": "99999"
							},
							{
								"name": "历城区",
								"pid": "370100",
								"level": "3",
								"id": "370112",
								"code": "370112",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "河南省",
				"pid": "0",
				"level": "1",
				"id": "410000",
				"code": "410000",
				"sort": "99999",
				"cities": [
					{
						"name": "郑州市",
						"pid": "410000",
						"level": "2",
						"id": "410100",
						"code": "410100",
						"sort": "18",
						"districts": [
							{
								"name": "市辖区",
								"pid": "410100",
								"level": "3",
								"id": "410101",
								"code": "410101",
								"sort": "99999"
							},
							{
								"name": "中原区",
								"pid": "410100",
								"level": "3",
								"id": "410102",
								"code": "410102",
								"sort": "99999"
							},
							{
								"name": "二七区",
								"pid": "410100",
								"level": "3",
								"id": "410103",
								"code": "410103",
								"sort": "99999"
							},
							{
								"name": "管城回族区",
								"pid": "410100",
								"level": "3",
								"id": "410104",
								"code": "410104",
								"sort": "99999"
							},
							{
								"name": "金水区",
								"pid": "410100",
								"level": "3",
								"id": "410105",
								"code": "410105",
								"sort": "99999"
							},
							{
								"name": "惠济区",
								"pid": "410100",
								"level": "3",
								"id": "410108",
								"code": "410108",
								"sort": "99999"
							},
							{
								"name": "中牟县",
								"pid": "410100",
								"level": "3",
								"id": "410122",
								"code": "410122",
								"sort": "99999"
							},
							{
								"name": "新郑市",
								"pid": "410100",
								"level": "3",
								"id": "410184",
								"code": "410184",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "湖北省",
				"pid": "0",
				"level": "1",
				"id": "420000",
				"code": "420000",
				"sort": "99999",
				"cities": [
					{
						"name": "武汉市",
						"pid": "420000",
						"level": "2",
						"id": "420100",
						"code": "420100",
						"sort": "11",
						"districts": [
							{
								"name": "江岸区",
								"pid": "420100",
								"level": "3",
								"id": "420102",
								"code": "420102",
								"sort": "99999"
							},
							{
								"name": "江汉区",
								"pid": "420100",
								"level": "3",
								"id": "420103",
								"code": "420103",
								"sort": "99999"
							},
							{
								"name": "硚口区",
								"pid": "420100",
								"level": "3",
								"id": "420104",
								"code": "420104",
								"sort": "99999"
							},
							{
								"name": "汉阳区",
								"pid": "420100",
								"level": "3",
								"id": "420105",
								"code": "420105",
								"sort": "99999"
							},
							{
								"name": "武昌区",
								"pid": "420100",
								"level": "3",
								"id": "420106",
								"code": "420106",
								"sort": "99999"
							},
							{
								"name": "青山区",
								"pid": "420100",
								"level": "3",
								"id": "420107",
								"code": "420107",
								"sort": "99999"
							},
							{
								"name": "洪山区",
								"pid": "420100",
								"level": "3",
								"id": "420111",
								"code": "420111",
								"sort": "99999"
							},
							{
								"name": "东西湖区",
								"pid": "420100",
								"level": "3",
								"id": "420112",
								"code": "420112",
								"sort": "99999"
							},
							{
								"name": "江夏区",
								"pid": "420100",
								"level": "3",
								"id": "420115",
								"code": "420115",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "湖南省",
				"pid": "0",
				"level": "1",
				"id": "430000",
				"code": "430000",
				"sort": "99999",
				"cities": [
					{
						"name": "长沙市",
						"pid": "430000",
						"level": "2",
						"id": "430100",
						"code": "430100",
						"sort": "12",
						"districts": [
							{
								"name": "芙蓉区",
								"pid": "430100",
								"level": "3",
								"id": "430102",
								"code": "430102",
								"sort": "99999"
							},
							{
								"name": "天心区",
								"pid": "430100",
								"level": "3",
								"id": "430103",
								"code": "430103",
								"sort": "99999"
							},
							{
								"name": "岳麓区",
								"pid": "430100",
								"level": "3",
								"id": "430104",
								"code": "430104",
								"sort": "99999"
							},
							{
								"name": "开福区",
								"pid": "430100",
								"level": "3",
								"id": "430105",
								"code": "430105",
								"sort": "99999"
							},
							{
								"name": "雨花区",
								"pid": "430100",
								"level": "3",
								"id": "430111",
								"code": "430111",
								"sort": "99999"
							},
							{
								"name": "望城区",
								"pid": "430100",
								"level": "3",
								"id": "430112",
								"code": "430112",
								"sort": "99999"
							},
							{
								"name": "长沙县",
								"pid": "430100",
								"level": "3",
								"id": "430121",
								"code": "430121",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "广东省",
				"pid": "0",
				"level": "1",
				"id": "440000",
				"code": "440000",
				"sort": "99999",
				"cities": [
					{
						"name": "广州市",
						"pid": "440000",
						"level": "2",
						"id": "440100",
						"code": "440100",
						"sort": "4",
						"districts": [
							{
								"name": "荔湾区",
								"pid": "440100",
								"level": "3",
								"id": "440103",
								"code": "440103",
								"sort": "99999"
							},
							{
								"name": "越秀区",
								"pid": "440100",
								"level": "3",
								"id": "440104",
								"code": "440104",
								"sort": "99999"
							},
							{
								"name": "海珠区",
								"pid": "440100",
								"level": "3",
								"id": "440105",
								"code": "440105",
								"sort": "99999"
							},
							{
								"name": "天河区",
								"pid": "440100",
								"level": "3",
								"id": "440106",
								"code": "440106",
								"sort": "99999"
							},
							{
								"name": "白云区",
								"pid": "440100",
								"level": "3",
								"id": "440111",
								"code": "440111",
								"sort": "99999"
							},
							{
								"name": "黄埔区",
								"pid": "440100",
								"level": "3",
								"id": "440112",
								"code": "440112",
								"sort": "99999"
							},
							{
								"name": "番禺区",
								"pid": "440100",
								"level": "3",
								"id": "440113",
								"code": "440113",
								"sort": "99999"
							},
							{
								"name": "花都区",
								"pid": "440100",
								"level": "3",
								"id": "440114",
								"code": "440114",
								"sort": "99999"
							},
							{
								"name": "增城市",
								"pid": "440100",
								"level": "3",
								"id": "440183",
								"code": "440183",
								"sort": "99999"
							}
						]
					},
					{
						"name": "深圳市",
						"pid": "440000",
						"level": "2",
						"id": "440300",
						"code": "440300",
						"sort": "3",
						"districts": [
							{
								"name": "罗湖区",
								"pid": "440300",
								"level": "3",
								"id": "440303",
								"code": "440303",
								"sort": "99999"
							},
							{
								"name": "福田区",
								"pid": "440300",
								"level": "3",
								"id": "440304",
								"code": "440304",
								"sort": "99999"
							},
							{
								"name": "南山区",
								"pid": "440300",
								"level": "3",
								"id": "440305",
								"code": "440305",
								"sort": "99999"
							},
							{
								"name": "宝安区",
								"pid": "440300",
								"level": "3",
								"id": "440306",
								"code": "440306",
								"sort": "99999"
							},
							{
								"name": "龙岗区",
								"pid": "440300",
								"level": "3",
								"id": "440307",
								"code": "440307",
								"sort": "99999"
							},
							{
								"name": "盐田区",
								"pid": "440300",
								"level": "3",
								"id": "440308",
								"code": "440308",
								"sort": "99999"
							},
							{
								"name": "龙华区",
								"pid": "440300",
								"level": "3",
								"id": "440309",
								"code": "440309",
								"sort": "99999"
							},
							{
								"name": "坪山区",
								"pid": "440300",
								"level": "3",
								"id": "440310",
								"code": "440310",
								"sort": "99999"
							}
						]
					},
					{
						"name": "佛山市",
						"pid": "440000",
						"level": "2",
						"id": "440600",
						"code": "440600",
						"sort": "15",
						"districts": [
							{
								"name": "禅城区",
								"pid": "440600",
								"level": "3",
								"id": "440604",
								"code": "440604",
								"sort": "99999"
							},
							{
								"name": "南海区",
								"pid": "440600",
								"level": "3",
								"id": "440605",
								"code": "440605",
								"sort": "99999"
							}
						]
					},
					{
						"name": "东莞市",
						"pid": "440000",
						"level": "2",
						"id": "441900",
						"code": "441900",
						"sort": "4",
						"districts": [
							{
								"name": "东莞",
								"pid": "441900",
								"level": "3",
								"id": "441901",
								"code": "441901",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "广西",
				"pid": "0",
				"level": "1",
				"id": "450000",
				"code": "450000",
				"sort": "99999",
				"cities": [
					{
						"name": "南宁市",
						"pid": "450000",
						"level": "2",
						"id": "450100",
						"code": "450100",
						"sort": "28",
						"districts": [
							{
								"name": "市辖区",
								"pid": "450100",
								"level": "3",
								"id": "450101",
								"code": "450101",
								"sort": "99999"
							},
							{
								"name": "兴宁区",
								"pid": "450100",
								"level": "3",
								"id": "450102",
								"code": "450102",
								"sort": "99999"
							},
							{
								"name": "青秀区",
								"pid": "450100",
								"level": "3",
								"id": "450103",
								"code": "450103",
								"sort": "99999"
							},
							{
								"name": "江南区",
								"pid": "450100",
								"level": "3",
								"id": "450105",
								"code": "450105",
								"sort": "99999"
							},
							{
								"name": "西乡塘区",
								"pid": "450100",
								"level": "3",
								"id": "450107",
								"code": "450107",
								"sort": "99999"
							},
							{
								"name": "良庆区",
								"pid": "450100",
								"level": "3",
								"id": "450108",
								"code": "450108",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "重庆市",
				"pid": "0",
				"level": "1",
				"id": "500000",
				"code": "500000",
				"sort": "99999",
				"cities": [
					{
						"name": "重庆市",
						"pid": "500000",
						"level": "2",
						"id": "500100",
						"code": "500100",
						"sort": "8",
						"districts": [
							{
								"name": "渝中区",
								"pid": "500100",
								"level": "3",
								"id": "500103",
								"code": "500103",
								"sort": "99999"
							},
							{
								"name": "大渡口区",
								"pid": "500100",
								"level": "3",
								"id": "500104",
								"code": "500104",
								"sort": "99999"
							},
							{
								"name": "江北区",
								"pid": "500100",
								"level": "3",
								"id": "500105",
								"code": "500105",
								"sort": "99999"
							},
							{
								"name": "沙坪坝区",
								"pid": "500100",
								"level": "3",
								"id": "500106",
								"code": "500106",
								"sort": "99999"
							},
							{
								"name": "九龙坡区",
								"pid": "500100",
								"level": "3",
								"id": "500107",
								"code": "500107",
								"sort": "99999"
							},
							{
								"name": "南岸区",
								"pid": "500100",
								"level": "3",
								"id": "500108",
								"code": "500108",
								"sort": "99999"
							},
							{
								"name": "渝北区",
								"pid": "500100",
								"level": "3",
								"id": "500112",
								"code": "500112",
								"sort": "99999"
							},
							{
								"name": "巴南区",
								"pid": "500100",
								"level": "3",
								"id": "500113",
								"code": "500113",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "四川省",
				"pid": "0",
				"level": "1",
				"id": "510000",
				"code": "510000",
				"sort": "99999",
				"cities": [
					{
						"name": "成都市",
						"pid": "510000",
						"level": "2",
						"id": "510100",
						"code": "510100",
						"sort": "7",
						"districts": [
							{
								"name": "市辖区",
								"pid": "510100",
								"level": "3",
								"id": "510101",
								"code": "510101",
								"sort": "99999"
							},
							{
								"name": "锦江区",
								"pid": "510100",
								"level": "3",
								"id": "510104",
								"code": "510104",
								"sort": "99999"
							},
							{
								"name": "青羊区",
								"pid": "510100",
								"level": "3",
								"id": "510105",
								"code": "510105",
								"sort": "99999"
							},
							{
								"name": "金牛区",
								"pid": "510100",
								"level": "3",
								"id": "510106",
								"code": "510106",
								"sort": "99999"
							},
							{
								"name": "武侯区",
								"pid": "510100",
								"level": "3",
								"id": "510107",
								"code": "510107",
								"sort": "99999"
							},
							{
								"name": "成华区",
								"pid": "510100",
								"level": "3",
								"id": "510108",
								"code": "510108",
								"sort": "99999"
							},
							{
								"name": "龙泉驿区",
								"pid": "510100",
								"level": "3",
								"id": "510112",
								"code": "510112",
								"sort": "99999"
							},
							{
								"name": "新都区",
								"pid": "510100",
								"level": "3",
								"id": "510114",
								"code": "510114",
								"sort": "99999"
							},
							{
								"name": "温江区",
								"pid": "510100",
								"level": "3",
								"id": "510115",
								"code": "510115",
								"sort": "99999"
							},
							{
								"name": "双流区",
								"pid": "510100",
								"level": "3",
								"id": "510122",
								"code": "510122",
								"sort": "99999"
							},
							{
								"name": "郫县",
								"pid": "510100",
								"level": "3",
								"id": "510124",
								"code": "510124",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "贵州省",
				"pid": "0",
				"level": "1",
				"id": "520000",
				"code": "520000",
				"sort": "99999",
				"cities": [
					{
						"name": "贵阳市",
						"pid": "520000",
						"level": "2",
						"id": "520100",
						"code": "520100",
						"sort": "99999",
						"districts": [
							{
								"name": "南明区",
								"pid": "520100",
								"level": "3",
								"id": "520102",
								"code": "520102",
								"sort": "99999"
							},
							{
								"name": "云岩区",
								"pid": "520100",
								"level": "3",
								"id": "520103",
								"code": "520103",
								"sort": "99999"
							},
							{
								"name": "花溪区",
								"pid": "520100",
								"level": "3",
								"id": "520111",
								"code": "520111",
								"sort": "99999"
							},
							{
								"name": "乌当区",
								"pid": "520100",
								"level": "3",
								"id": "520112",
								"code": "520112",
								"sort": "99999"
							},
							{
								"name": "白云区",
								"pid": "520100",
								"level": "3",
								"id": "520113",
								"code": "520113",
								"sort": "99999"
							},
							{
								"name": "观山湖区",
								"pid": "520100",
								"level": "3",
								"id": "520115",
								"code": "520115",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "云南省",
				"pid": "0",
				"level": "1",
				"id": "530000",
				"code": "530000",
				"sort": "99999",
				"cities": [
					{
						"name": "昆明市",
						"pid": "530000",
						"level": "2",
						"id": "530100",
						"code": "530100",
						"sort": "22",
						"districts": [
							{
								"name": "市辖区",
								"pid": "530100",
								"level": "3",
								"id": "530101",
								"code": "530101",
								"sort": "99999"
							},
							{
								"name": "五华区",
								"pid": "530100",
								"level": "3",
								"id": "530102",
								"code": "530102",
								"sort": "99999"
							},
							{
								"name": "盘龙区",
								"pid": "530100",
								"level": "3",
								"id": "530103",
								"code": "530103",
								"sort": "99999"
							},
							{
								"name": "官渡区",
								"pid": "530100",
								"level": "3",
								"id": "530111",
								"code": "530111",
								"sort": "99999"
							},
							{
								"name": "西山区",
								"pid": "530100",
								"level": "3",
								"id": "530112",
								"code": "530112",
								"sort": "99999"
							},
							{
								"name": "呈贡区",
								"pid": "530100",
								"level": "3",
								"id": "530114",
								"code": "530114",
								"sort": "99999"
							}
						]
					}
				]
			},
			{
				"name": "陕西省",
				"pid": "0",
				"level": "1",
				"id": "610000",
				"code": "610000",
				"sort": "99999",
				"cities": [
					{
						"name": "西安市",
						"pid": "610000",
						"level": "2",
						"id": "610100",
						"code": "610100",
						"sort": "9",
						"districts": [
							{
								"name": "新城区",
								"pid": "610100",
								"level": "3",
								"id": "610102",
								"code": "610102",
								"sort": "99999"
							},
							{
								"name": "碑林区",
								"pid": "610100",
								"level": "3",
								"id": "610103",
								"code": "610103",
								"sort": "99999"
							},
							{
								"name": "莲湖区",
								"pid": "610100",
								"level": "3",
								"id": "610104",
								"code": "610104",
								"sort": "99999"
							},
							{
								"name": "灞桥区",
								"pid": "610100",
								"level": "3",
								"id": "610111",
								"code": "610111",
								"sort": "99999"
							},
							{
								"name": "未央区",
								"pid": "610100",
								"level": "3",
								"id": "610112",
								"code": "610112",
								"sort": "99999"
							},
							{
								"name": "雁塔区",
								"pid": "610100",
								"level": "3",
								"id": "610113",
								"code": "610113",
								"sort": "99999"
							},
							{
								"name": "长安区",
								"pid": "610100",
								"level": "3",
								"id": "610116",
								"code": "610116",
								"sort": "99999"
							},
							{
								"name": "西咸新区",
								"pid": "610100",
								"level": "3",
								"id": "610130",
								"code": "610130",
								"sort": "99999"
							}
						]
					}
				]
			}
		]
	}
};
